:PROPERTIES:
:ID:       635ec3e2-f275-45ec-b7fa-507e72855cce
:END:
#+title: numpy-统计和属性
#+startup: overview
#+filetags: :python:numpy:统计和属性:

* 统计和属性
关于array的基本属性有以下几个：
- 尺寸相关
- 最大、最小、中位、分位值
- 平均、求和、标准差
这些都是描述性统计相关的指标。
要特别关注下面两个重要的特性：
- 按维度（指定axis）求结果，一般0表示列，1表示行，可以用“沿着行或沿着列操作”
- 计算后保持维度（keepdims=True）
* 尺寸相关
#+begin_src python :results output 
import numpy as np

rng = np.random.default_rng(seed=42)
arr = rng.uniform(0, 1, (3, 4))
print(arr)

# NOTE: 维度
print(f"维度是：{ arr.ndim }")
# NOTE: 形状
print(f"形状是：{arr.shape}")
# NOTE: 数据量
print(f"元素个数：{arr.size}")
#+end_src

#+RESULTS:
: [[0.77395605 0.43887844 0.85859792 0.69736803]
:  [0.09417735 0.97562235 0.7611397  0.78606431]
:  [0.12811363 0.45038594 0.37079802 0.92676499]]
: 维度是：2
: 形状是：(3, 4)
: 元素个数：12

* 最值分位
#+begin_src python :results output
import numpy as np

rng = np.random.default_rng(seed=42)
arr = rng.uniform(0, 1, (3, 4))
print(arr)

# NOTE: 最大值
print(f"最大值是：{arr.max()}")
# NOTE: 按维度（扫描每一列）
print(f"列最大值是：{arr.max(axis=0)}")
print(f"列最大值是：{np.amax(arr, axis=0)}")
# NOTE: 按维度（扫描每一行）
print(f"行最大值是：{arr.max(axis=1)}")
print(f"列最大值是：{np.amax(arr, axis=1)}")

# NOTE: 是否保持原来的维度
# 这个需要特别注意下，很多深度学习模型中都需要保持原有的维度进行后续计算
# 按照当前的例子，如果不设置keepdims为True，那么结果就是一个一维数组，如果设置了，那么结果就是一个3x1的矩阵（二维数组）
print(arr.min(axis=1, keepdims=True))


# NOTE:  中位数
# 按列取1/4数
print(f"1/4列中位数是：{np.quantile(arr, q = 0.25, axis=0)}")
# 按行取3/4数，保持维度
print(f"3/4行中位数是：{np.quantile(arr, q = 0.75, axis=1, keepdims=True)}")
#+end_src

#+RESULTS:
#+begin_example
[[0.77395605 0.43887844 0.85859792 0.69736803]
 [0.09417735 0.97562235 0.7611397  0.78606431]
 [0.12811363 0.45038594 0.37079802 0.92676499]]
最大值是：0.9756223516367559
列最大值是：[0.77395605 0.97562235 0.85859792 0.92676499]
列最大值是：[0.77395605 0.97562235 0.85859792 0.92676499]
行最大值是：[0.85859792 0.97562235 0.92676499]
列最大值是：[0.85859792 0.97562235 0.92676499]
[[0.43887844]
 [0.09417735]
 [0.12811363]]
中位数是：[0.11114549 0.44463219 0.56596886 0.74171617]
中位数是：[[0.79511652]
 [0.83345382]
 [0.5694807 ]]
#+end_example

* 平均求和标准差
#+begin_src python :results output
import numpy as np

rng = np.random.default_rng(seed=42)
arr = rng.uniform(0, 1, (3, 4))
print(arr)

# NOTE: 求平均值
print(f"平均值是：{np.average(arr)}")
print(f"列平均值是：{np.average(arr, axis=0, keepdims=True)}")
print(f"行平均值是：{np.average(arr, axis=1, keepdims=True)}")

# NOTE: 求和
print(f"列总和是：{np.sum(arr, axis=0, keepdims=True)}")
print(f"行总和是：{np.sum(arr, axis=1, keepdims=True)}")
# NOTE: 累计求和意思是可以看到累加过程
print(f"列累计总和是：{np.cumsum(arr, axis = 0)}")
print(f"行累计总和是：{np.cumsum(arr, axis = 1)}")

# NOTE: 标准差
print(f"标准差是：{np.std(arr)}")
print(f"列标准差是：{np.std(arr, axis=0, keepdims=True)}")
print(f"行标准差是：{np.std(arr, axis=1, keepdims=True)}")

# NOTE: 方差
print(f"方差是：{np.var(arr)}")
print(f"列方差是：{np.var(arr, axis=0, keepdims=True)}")
print(f"行方差是：{np.var(arr, axis=1, keepdims=True)}")
#+end_src

#+RESULTS:
#+begin_example
[[0.77395605 0.43887844 0.85859792 0.69736803]
 [0.09417735 0.97562235 0.7611397  0.78606431]
 [0.12811363 0.45038594 0.37079802 0.92676499]]
平均值是：0.6051555606435642
列平均值是：[[0.33208234 0.62162891 0.66351188 0.80339911]]
行平均值是：[[0.69220011]
 [0.65425093]
 [0.46901565]]
列总和是：[[0.99624703 1.86488673 1.99053565 2.41019732]]
行总和是：[[2.76880044]
 [2.61700371]
 [1.87606258]]
列累计总和是：[[0.77395605 0.43887844 0.85859792 0.69736803]
 [0.8681334  1.41450079 1.61973762 1.48343233]
 [0.99624703 1.86488673 1.99053565 2.41019732]]
行累计总和是：[[0.77395605 1.21283449 2.07143241 2.76880044]
 [0.09417735 1.0697997  1.8309394  2.61700371]
 [0.12811363 0.57849957 0.94929759 1.87606258]]
标准差是：0.28783096517727075
列标准差是：[[0.3127589  0.25035525 0.21076935 0.09444968]]
行标准差是：[[0.15697997]
 [0.33382704]
 [0.28971642]]
方差是：0.08284666451487924
列方差是：[[0.09781813 0.06267775 0.04442372 0.00892074]]
行方差是：[[0.02464271]
 [0.1114405 ]
 [0.0839356 ]]
#+end_example

